podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/SIM_MK40D7.svd.xml
            <register>
               <name>SOPT4</name>
               <description>System Options Register 4</description>
               <addressOffset>0x100C</addressOffset>
               <fields>
                  <field>
                     <name>FTM0FLT0</name>
                     <description>FTM0 Fault 0 Drive Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>FTM0_FLT0 pin</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>CMP0_OUT</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FTM0FLT1</name>
                     <description>FTM0 Fault 1 Drive Select</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>FTM0_FLT1 pin</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>CMP1_OUT</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FTM0FLT2</name>
                     <description>FTM0 Fault 2 Drive Select</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>FTM0_FLT2</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>CMP2 OUT</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FTM1FLT0</name>
                     <description>FTM1 Fault 0 Drive Select</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>FTM1_FLT0</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>CMP0_OUT</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FTM2FLT0</name>
                     <description>FTM2 Fault 0 Drive Select</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>FTM2_FLT0</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>CMP0_OUT</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FTM1CH0SRC</name>
                     <description>FTM1 channel 0 input capture source select</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>FTM1_CH0</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>CMP0_OUT</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>CMP1_OUT</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>USB SOF trigger</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FTM2CH0SRC</name>
                     <description>FTM2 channel 0 input capture source select</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>FTM2_CH0</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>CMP0_OUT</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>CMP1_OUT</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Reserved</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FTM0CLKSEL</name>
                     <description>FTM0 External Clock Pin Select</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>FTM_CLK0</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>FTM_CLK1</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="FTM0CLKSEL" > <name>FTM1CLKSEL</name> <description>FTM1 External Clock Pin Select</description> <bitOffset>25</bitOffset> </field>
                  <field derivedFrom="FTM0CLKSEL" > <name>FTM2CLKSEL</name> <description>FTM2 External Clock Pin Select</description> <bitOffset>26</bitOffset> </field>
                  <field>
                     <name>FTM0TRG0SRC</name>
                     <description>FTM0 Hardware Trigger 0 Source Select</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>CMP0_OUT</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>FTM1 channel match</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FTM0TRG1SRC</name>
                     <description>FTM0 Hardware Trigger 1 Source Select</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>PDB output trigger</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>FTM2 channel match trigger</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SOPT5</name>
               <description>System Options Register 5</description>
               <addressOffset>0x1010</addressOffset>
               <fields>
                  <field>
                     <name>UART0TXSRC</name>
                     <description>UART0 Transmit Data Source Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>UART0_TX pin</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>UART0_TX pin modulated by FTM1 CH0</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>UART0_TX pin modulated by FTM2 CH0</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Reserved</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>UART0RXSRC</name>
                     <description>UART0 Receive Data Source Select</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>UART0_RX pin</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>CMP0</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>CMP1</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Reserved</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>UART1TXSRC</name>
                     <description>UART1 Transmit Data Source Select</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>UART1_TX pin</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>UART1_TX pin modulated by FTM1 CH0</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>UART1_TX pin modulated by FTM2 CH0</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Reserved</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>UART1RXSRC</name>
                     <description>UART1 Receive Data Source Select</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>UART1_RX pin</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>CMP0</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>CMP1</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Reserved</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SOPT7</name>
               <description>System Options Register 7</description>
               <addressOffset>0x1018</addressOffset>
               <fields>
                  <field>
                     <name>ADC0TRGSEL</name>
                     <description>ADC0 Trigger Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0000</name>
                           <description>PDB external trigger</description>
                           <value>0b0000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0001</name>
                           <description>CMP 0</description>
                           <value>0b0001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0010</name>
                           <description>CMP 1</description>
                           <value>0b0010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0011</name>
                           <description>CMP 2</description>
                           <value>0b0011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0100</name>
                           <description>PIT trigger 0</description>
                           <value>0b0100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0101</name>
                           <description>PIT trigger 1</description>
                           <value>0b0101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0110</name>
                           <description>PIT trigger 2</description>
                           <value>0b0110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0111</name>
                           <description>PIT trigger 3</description>
                           <value>0b0111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1000</name>
                           <description>FTM0 trigger</description>
                           <value>0b1000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1001</name>
                           <description>FTM1 trigger</description>
                           <value>0b1001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1010</name>
                           <description>FTM2 trigger</description>
                           <value>0b1010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1011</name>
                           <description>Unused</description>
                           <value>0b1011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1100</name>
                           <description>RTC alarm</description>
                           <value>0b1100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1101</name>
                           <description>RTC seconds</description>
                           <value>0b1101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1110</name>
                           <description>LPTMR trigger</description>
                           <value>0b1110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1111</name>
                           <description>Unused</description>
                           <value>0b1111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADC0PRETRGSEL</name>
                     <description>ADC0 PreTrigger Select</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Pretrigger A</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Pretrigger B</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADC0ALTTRGEN</name>
                     <description>ADC0 Alternate Trigger Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>PDB trigger</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Alternate trigger</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="ADC0TRGSEL" > <name>ADC1TRGSEL</name> <description>ADC1 Trigger Select</description> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="ADC0PRETRGSEL" > <name>ADC1PRETRGSEL</name> <description>ADC1 PreTrigger Select</description> <bitOffset>12</bitOffset> </field>
                  <field derivedFrom="ADC0ALTTRGEN" > <name>ADC1ALTTRGEN</name> <description>ADC1 Alternate Trigger Enable</description> <bitOffset>15</bitOffset> </field>
               </fields>
            </register>
