podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/SIM_MK40D7.svd.xml
            <register>
               <name>CLKDIV1</name>
               <description>System Clock Divider Register 1</description>
               <addressOffset>0x1044</addressOffset>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>OUTDIV4</name>
                     <description>Clock 4 Output Divider value\n
This field sets the divide value for the flash clock.\n
At the end of reset, it is loaded with either 0001 or 1111 depending on FTFL_FOPT[LPBOOT]</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0000</name>
                           <description>Divide-by-1</description>
                           <value>0b0000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0001</name>
                           <description>Divide-by-2</description>
                           <value>0b0001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0010</name>
                           <description>Divide-by-3</description>
                           <value>0b0010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0011</name>
                           <description>Divide-by-4</description>
                           <value>0b0011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0100</name>
                           <description>Divide-by-5</description>
                           <value>0b0100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0101</name>
                           <description>Divide-by-6</description>
                           <value>0b0101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0110</name>
                           <description>Divide-by-7</description>
                           <value>0b0110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0111</name>
                           <description>Divide-by-8</description>
                           <value>0b0111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1000</name>
                           <description>Divide-by-9</description>
                           <value>0b1000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1001</name>
                           <description>Divide-by-10</description>
                           <value>0b1001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1010</name>
                           <description>Divide-by-11</description>
                           <value>0b1010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1011</name>
                           <description>Divide-by-12</description>
                           <value>0b1011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1100</name>
                           <description>Divide-by-13</description>
                           <value>0b1100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1101</name>
                           <description>Divide-by-14</description>
                           <value>0b1101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1110</name>
                           <description>Divide-by-15</description>
                           <value>0b1110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1111</name>
                           <description>Divide-by-16</description>
                           <value>0b1111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="OUTDIV4" > <name>OUTDIV3</name> <description>Clock 3 Output Divider value\n
This field sets the divide value for the Flexbus clock driven to the external pin (FB_CLK).\n
At the end of reset, it is loaded with either 0001 or 1111 depending on FTFL_FOPT[LPBOOT]</description> <bitOffset>20</bitOffset> </field>
                  <field derivedFrom="OUTDIV4" > <name>OUTDIV2</name> <description>Clock 2 Output Divider value\n
This field sets the divide value for the peripheral clock.\n
At the end of reset, it is loaded with either 0000 or 0111 depending on FTFL_FOPT[LPBOOT]</description> <bitOffset>24</bitOffset> </field>
                  <field derivedFrom="OUTDIV4" > <name>OUTDIV1</name> <description>Clock 1 Output Divider value\n
This field sets the divide value for the core/system clock.\n
At the end of reset, it is loaded with either 0000 or 0111 depending on FTFL_FOPT[LPBOOT]</description> <bitOffset>28</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>CLKDIV2</name>
               <description>System Clock Divider Register 2\n
This register sets the clock divider when the USB clock source is MCGFLLCLK/MCGPLLCLK (SOPT2[USBSRC]).\n
Output clock = Input clock x [ (USBFRAC+1) / (USBDIV+1) ]</description>
               <addressOffset>0x1048</addressOffset>
               <fields>
                  <field>
                     <name>USBFRAC</name>
                     <description>USB clock divider fraction</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USBDIV</name>
                     <description>USB clock divider divisor</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FCFG1</name>
               <description>Flash Configuration Register 1</description>
               <addressOffset>0x104C</addressOffset>
               <fields>
                  <field>
                     <name>FLASHDIS</name>
                     <description>Flash Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Flash is enabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Flash is disabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FLASHDOZE</name>
                     <description>Flash Doze\n
Allows flash to be disabled during Wait mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Enabled during Wait</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Disabled during Wait</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DEPART</name>
                     <description>FlexNVM partition</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>EESIZE</name>
                     <description>EEPROM size</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0000</name>
                           <description>Reserved</description>
                           <value>0b0000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0001</name>
                           <description>Reserved</description>
                           <value>0b0001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0010</name>
                           <description>4 KB</description>
                           <value>0b0010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0011</name>
                           <description>2 KB</description>
                           <value>0b0011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0100</name>
                           <description>1 KB</description>
                           <value>0b0100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0101</name>
                           <description>512 Bytes</description>
                           <value>0b0101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0110</name>
                           <description>256 Bytes</description>
                           <value>0b0110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0111</name>
                           <description>128 Bytes</description>
                           <value>0b0111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1000</name>
                           <description>64 Bytes</description>
                           <value>0b1000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1001</name>
                           <description>32 Bytes</description>
                           <value>0b1001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1111</name>
                           <description>0 Bytes</description>
                           <value>0b1111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PFSIZE</name>
                     <description>Program Flash Size</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0011</name>
                           <description>32 KB PFLASH, 1 KB protection</description>
                           <value>0b0011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0101</name>
                           <description>64 KB PFLASH, 2 KB protection</description>
                           <value>0b0101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0111</name>
                           <description>128 KB PFLASH, 4 KB protection</description>
                           <value>0b0111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1001</name>
                           <description>256 KB PFLASH, 8 KB protection</description>
                           <value>0b1001</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NVMSIZE</name>
                     <description>FlexNVM size</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0000</name>
                           <description>0 KB of FlexNVM</description>
                           <value>0b0000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0011</name>
                           <description>32 KB FlexNVM, 4 KB protection</description>
                           <value>0b0011</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>FCFG2</name>
               <description>Flash Configuration Register 2</description>
               <addressOffset>0x1050</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>MAXADDR1</name>
                     <description>Max address block 1\n
This field concatenated with leading zeros indicates the first invalid address of flash block 1</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>PFLSH</name>
                     <description>Program flash</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Physical Flash block 1 is FlexNVM</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Physical Flash block 1 is PFlash</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MAXADDR0</name>
                     <description>Max address block 0\n
This field concatenated with leading zeros indicates the first invalid address of flash block 0</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>SWAPPFLSH</name>
                     <description>Swap program flash</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Swap is not active</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Swap is active</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>UIDH</name>
               <description>Unique Identification Register High</description>
               <addressOffset>0x1054</addressOffset>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>UID</name>
                     <description>Unique Identification</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>UIDMH</name>
               <description>Unique Identification Register Mid-High</description>
               <addressOffset>0x1058</addressOffset>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>UID</name>
                     <description>Unique Identification</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>UIDML</name>
               <description>Unique Identification Register Mid Low</description>
               <addressOffset>0x105C</addressOffset>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>UID</name>
                     <description>Unique Identification</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>UIDL</name>
               <description>Unique Identification Register Low</description>
               <addressOffset>0x1060</addressOffset>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>UID</name>
                     <description>Unique Identification</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
